PinkFluffyUnic0rn/stm32flight/main.c
/**
* @file main.c
* @brief Main file with entry point
*/

#include <math.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ctype.h>

#include "stm32f4xx_hal.h"

#include "stm32periph.h"
#include "settings.h"
#include "dsp.h"
#include "log.h"
#include "crc.h"
#include "global.h"
#include "runvals.h"
#include "timev.h"
#include "command.h"
#include "config.h"
#include "util.h"

#include "device.h"
#include "icm42688.h"
#include "dps368.h"
#include "esp8266.h"
#include "qmc5883l.h"
#include "crsf.h"
#include "w25.h"
#include "m10.h"
#include "uartconf.h"
#include "irc.h"

#include "thrust.h"

/**
* @brief External interrupt callback. It calls interrupt handlers
	from drivers for devices that use external interrupts.
* @param pin number of pin triggered the callback
* @return none
*/
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(dev[DEV_ESP].status)) {
		dev[DEV_ESP].interrupt(dev[DEV_ESP].priv, &pin);
	}
}

/**
* @brief UART receive callback. It calls interrupt handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback
* @return none
*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(dev[DEV_M10].status))
		dev[DEV_M10].interrupt(dev[DEV_M10].priv, huart);

	if (DEVITENABLED(dev[DEV_CRSF].status))
		dev[DEV_CRSF].interrupt(dev[DEV_CRSF].priv, huart);

	if (DEVITENABLED(dev[DEV_UART].status))
		dev[DEV_UART].interrupt(dev[DEV_UART].priv, huart);
}

/**
* @brief UART error callback. Calls UART error handlers
	from drivers for devices working through UART.
* @param huart context for UART triggered that callback.
* @return none
*/
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(dev[DEV_CRSF].status))
		dev[DEV_CRSF].error(dev[DEV_CRSF].priv, huart);
}

/**
* @brief Get battery voltage from ADC.
* @return battery voltage
*/
float batteryvoltage()
{
	uint32_t v;

	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 1);

	v = HAL_ADC_GetValue(&hadc1);

	HAL_ADC_Stop(&hadc1);

	return (v / (float) 0xfff * BAT_SCALE);
}

/**
* @brief Get ESC current from ADC.
* @return battery current in amperes
*/
float esccurrent()
{
	uint32_t v;

	HAL_ADC_Start(&hadc2);
	HAL_ADC_PollForConversion(&hadc2, 1);

	v = HAL_ADC_GetValue(&hadc2);

	HAL_ADC_Stop(&hadc2);

	return (v / (float) 0xfff * st.currscale + st.curroffset);
}

/**
* @brief Init ESC's.
* @return none
*/
static void esc_init()
{
	dshotinit();
}

/**
* @brief Init HP206c barometer.
* @return none
*/
static void dps_init()
{
	struct dps_device d;

	d.hi2c = &hi2c1;
	d.rate = DPS_RATE_32;
	d.osr = DPS_OSR_16;

	if (dps_initdevice(&d, dev + DEV_DPS) >= 0)
		uartprintf("DPS368 initilized\r\n");
	else
		uartprintf("failed to initilize DPS368\r\n");
}

/**
* @brief Init IRC tramp video transmitter.
* @return none
*/
static void irc_init()
{
	struct irc_device d;

	d.huart = &huart5;
	d.power = st.ircpower;
	d.frequency = st.ircfreq;

	if (irc_initdevice(&d, dev + DEV_IRC) >= 0)
		uartprintf("IRC device initilized\r\n");
	else
		uartprintf("failed to initilize IRC device\r\n");
}

/**
* @brief Init ICM-42688-P IMU.
* @return none
*/
static void icm_init()
{
	struct icm_device d;

	d.hspi = &hspi1;
	d.gpio = GPIOC;
	d.pin = GPIO_PIN_13;

	d.gyroscale = ICM_1000DPS;
	d.gyrorate = ICM_GYRO8K;
	d.gyroorder = ICM_GYROORDER3;
	d.gyrolpf = ICM_GYROLPFLL;
	d.accelscale = ICM_4G;
	d.accelrate = ICM_ACCEL8K;
	d.accellpf = ICM_ACCELLPFLL;
	d.accelorder = ICM_ACCELORDER3;

	if (icm_initdevice(&d, dev + DEV_ICM) >= 0)
		uartprintf("ICM-42688 initilized\r\n");
	else
		uartprintf("failed to initilize ICM-42688\r\n");
}

/**
* @brief Init QMC5883L magnetometer.
* @return none
*/
static void qmc_init()
{
	struct qmc_device d;

	d.hi2c = &hi2c1;
	d.scale = QMC_SCALE_8;
	d.rate = QMC_RATE_100;
	d.osr = QMC_OSR_512;

	if (qmc_initdevice(&d, dev + DEV_QMC) >= 0)
		uartprintf("QMC5883L initilized\r\n");
	else
		uartprintf("failed to initilize QMC5883L\r\n");
}

/**
* @brief Init ESP8285.
* @return none
*/
static void espdev_init()
{
	struct esp_device d;

	d.hspi = &hspi2;
	d.csgpio = GPIOC;
	d.cspin = GPIO_PIN_0;
	d.rstgpio = GPIOC;
	d.rstpin = GPIO_PIN_14;
	d.bootgpio = GPIOC;
	d.bootpin = GPIO_PIN_15;
	d.busygpio = GPIOB;
	d.busypin = GPIO_PIN_15;
	d.intpin = GPIO_PIN_1;

	if (esp_initdevice(&d, dev + DEV_ESP) < 0) {
		uartprintf("failed to initilize ESP8266\r\n");
		return;
	}

	uartprintf("ESP8266 initilized\r\n");
}

/**
* @brief Init ERLS receiver driver.
* @return none
*/
static void crsfdev_init()
{
	struct crsf_device d;

	d.huart = &huart2;

	crsf_initdevice(&d, dev + DEV_CRSF);
}

/**
* @brief Init W25Q onboard flash memory.
* @return none
*/
static void w25dev_init()
{
	struct w25_device d;

	d.hspi = &hspi1;
	d.gpio = GPIOB;
	d.pin = GPIO_PIN_3;

	if (w25_initdevice(&d, &flashdev) < 0) {
		uartprintf("failed to initilize W25Q\r\n");
		return;
	}

	uartprintf("W25Q initilized\r\n");
}

/**
* @brief Init GNSS module.
* @return none
*/
static void m10dev_init()
{
	struct m10_device d;

	d.huart = &huart3;

	if (m10_initdevice(&d, dev + DEV_M10) < 0) {
		uartprintf("failed to initilize GPS device\r\n");
		return;
	}

	uartprintf("GPS device initilized\r\n");
}

/**
* @brief Init UART config connection.
* @return none
*/
static void uartdev_init()
{
	struct uart_device d;

	d.huart = &huart4;

	if (uart_initdevice(&d, dev + DEV_UART) < 0) {
		uartprintf("failed to initilize UART device\r\n");
		return;
	}

	uartprintf("UART device initilized\r\n");
}

/**
* @brief Init/set stabilization loop.
* @param init 1, if called during initilization, 0 otherwise
* @return always 0
*/
int setstabilize(int init)
{
	// init complementary filters contexts
	dsp_setcompl(cmpl + CMPL_PITCH, st.atctcoef, PID_FREQ, init);
	dsp_setcompl(cmpl + CMPL_ROLL, st.atctcoef, PID_FREQ, init);
	dsp_setcompl(cmpl + CMPL_YAW, st.yctcoef, PID_FREQ, init);

	dsp_setcompl(cmpl + CMPL_CLIMBRATE, st.cctcoef, DPS_FREQ, init);
	dsp_setcompl(cmpl + CMPL_ALT, st.actcoef, DPS_FREQ, init);

	// init roll and pitch position PID controller contexts
	dsp_setpidbl(pid + PID_PITCHP, st.p, st.i, st.d, PID_MAX_I,
		st.dpt1freq, PID_FREQ, init);
	dsp_setpidbl(pid + PID_ROLLP, st.p, st.i, st.d, PID_MAX_I,
		st.dpt1freq, PID_FREQ, init);

	// init roll, pitch and yaw speed PID controller contexts
	dsp_setpidbl(pid + PID_PITCHS, st.sp, st.si, st.sd,
		PID_MAX_I, st.dpt1freq, PID_FREQ, init);
	dsp_setpidbl(pid + PID_ROLLS, st.sp, st.si, st.sd,
		PID_MAX_I, st.dpt1freq, PID_FREQ, init);
	dsp_setpidbl(pid + PID_YAWS, st.ysp, st.ysi, st.ysd,
		PID_MAX_I, st.dpt1freq, PID_FREQ, init);

