PinkFluffyUnic0rn/stm32flight/main.c
	// init yaw position PID controller's context
	dsp_setpid(&yawpv, st.yp, st.yi, st.yd, st.dpt1freq,
		PID_FREQ, init);

	// init vertical acceleration PID controller's context
	dsp_setpidbl(pid + PID_VA, st.zsp, st.zsi, st.zsd, PID_MAX_I,
		st.dpt1freq, PID_FREQ, init);

	// init climbrate PID controller's context
	dsp_setpidbl(pid + PID_CLIMBRATE, st.cp, st.ci, st.cd,
		PID_MAX_I, st.dpt1freq, PID_FREQ, init);

	// init altitude PID controller's context
	dsp_setpidbl(pid + PID_ALT, st.ap, st.ai, st.ad, PID_MAX_I,
		st.dpt1freq, PID_FREQ, init);

	// init battery voltage low-pass filter
	dsp_setlpf1f(lpf + LPF_BAT, BAT_CUTOFF, POWER_FREQ, init);
	dsp_setlpf1f(lpf + LPF_CUR, CUR_CUTOFF, POWER_FREQ, init);

	// init average thrust low-pass filter
	dsp_setunity(lpf + LPF_AVGTHR, init);

	// init low-pass fitlers for altitude and vertical acceleration
	dsp_setunity(lpf + LPF_BARTEMP, init);
	dsp_setlpf1t(lpf + LPF_THR, st.ttcoef, PID_FREQ, init);
	dsp_setunity(lpf + LPF_VAU, init);
	dsp_setlpf1t(lpf + LPF_VAPT1, st.ttcoef, PID_FREQ, init);
	dsp_setlpf1t(lpf + LPF_VAAVG, VA_AVG_TCOEF, PID_FREQ, init);
	dsp_setunity(lpf + LPF_FA, init);
	dsp_setunity(lpf + LPF_ALT, init);

	// init low-pass fitlers for IMU temperature sensor
	dsp_setlpf1t(lpf + LPF_IMUTEMP, TEMP_TCOEF, PID_FREQ, init);

	// init low-pass fitlers for accelerometer x, y and z axes
	dsp_setlpf1f(lpf + LPF_ACCX, st.accpt1freq, PID_FREQ, init);
	dsp_setlpf1f(lpf + LPF_ACCY, st.accpt1freq, PID_FREQ, init);
	dsp_setlpf1f(lpf + LPF_ACCZ, st.accpt1freq, PID_FREQ, init);

	// init low-pass fitlers for gyroscope x, y and z axes
	dsp_setlpf1f(lpf + LPF_GYROX, st.gyropt1freq, PID_FREQ, init);
	dsp_setlpf1f(lpf + LPF_GYROY, st.gyropt1freq, PID_FREQ, init);
	dsp_setlpf1f(lpf + LPF_GYROZ, st.gyropt1freq, PID_FREQ, init);

	// init low-pass fitlers for magnetometer x, y and z axes
	dsp_setlpf1t(lpf + LPF_MAGX, st.magpt1freq, QMC_FREQ, init);
	dsp_setlpf1t(lpf + LPF_MAGY, st.magpt1freq, QMC_FREQ, init);
	dsp_setlpf1t(lpf + LPF_MAGZ, st.magpt1freq, QMC_FREQ, init);

	return 0;
}

int initautopilot()
{

	pointscount = 0;

	return 0;
}

/**
* @brief Calculate tilt compensated heading direction
	using magnetometer readings, roll value and pitch value.
* @param r roll value
* @param p pitch value
* @param x magnetometer's X axis value
* @param y magnetometer's Y axis value
* @param z magnetometer's Z axis value
* @return tilt compensated heading
*/
float qmc_heading(float r, float p, float x, float y, float z)
{
	x = st.mxsc * (x + st.mx0);
	y = st.mysc * (y + st.my0);
	z = st.mzsc * (z + st.mz0);

	x = x * cosf(p) + y * sinf(r) * sinf(p)
		- z * cosf(r) * sinf(p);
	y = y * cosf(r) + z * sinf(r);

	return circf(atan2f(y, x) + st.magdecl);
}

/**
* @brief Stabilization loop. Callback for TEV_PID periodic event.
	It is the place where is almost all work happening.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int stabilize(int ms)
{
	struct icm_data id;
	float ltm, lbm, rbm, rtm;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float vx, vy, vz;
	float gy, gx, gz;
	float ay, ax, az;
	float va;
	float ht;
	float dt;

	// debug pin switching
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4,
		!(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)));

	// emergency disarm happened
	if (emergencydisarm) {
		setthrust(0.0, 0.0, 0.0, 0.0);
		en = 0.0;
	}

	// get time passed from last invocation of this calback function
	dt = ms / (float) TICKSPERSEC;

	// divide-by-zero protection
	dt = (dt < 0.000001) ? 0.000001 : dt;

	// update battery voltage
	log_write(LOG_BAT, dsp_getlpf(lpf + LPF_BAT));

	// toggle arming indication led
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6,
		(en > 0.5) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// get accelerometer and gyroscope readings
	dev[DEV_ICM].read(dev[DEV_ICM].priv, &id,
		sizeof(struct icm_data));

	id.afz += (id.ft - 25.0) * st.aztscale;

	// write accelerometer and gyroscope values into log
	log_write(LOG_ACC_X, id.afx);
	log_write(LOG_ACC_Y, id.afy);
	log_write(LOG_ACC_Z, id.afz);
	log_write(LOG_GYRO_X, id.gfx);
	log_write(LOG_GYRO_Y, id.gfy);
	log_write(LOG_GYRO_Z, id.gfz);

	// update accelerometer temperature
	dsp_updatelpf(lpf + LPF_IMUTEMP, id.ft);

	// apply accelerometer offsets
	ax = dsp_updatelpf(lpf + LPF_ACCX, id.afx) - st.ax0;
	ay = dsp_updatelpf(lpf + LPF_ACCY, id.afy) - st.ay0;
	az = dsp_updatelpf(lpf + LPF_ACCZ, id.afz) - st.az0;

	// update vertical acceleration low-pass filter
	dsp_updatelpf(lpf + LPF_THR, id.afz);

	// offset gyroscope readings by values, calculater
	// at power on and convert result into radians
	gx = deg2rad(dsp_updatelpf(lpf + LPF_GYROX, id.gfx) - st.gx0);
	gy = deg2rad(dsp_updatelpf(lpf + LPF_GYROY, id.gfy) - st.gy0);
	gz = deg2rad(dsp_updatelpf(lpf + LPF_GYROZ, id.gfz) - st.gz0);

	// update complimenraty filter for roll axis and get next roll
	// value. First signal (value) is signal to be integrated: it's
	// the speed of the rotation around Y axis. Second signal is
	// signal to be low-pass filtered: it's the tilt value that is
	// calculated from acceleromer readings through some
	// trigonometry.
	roll = dsp_updatecompl(cmpl + CMPL_ROLL, gy * dt,
		atan2f(-ax, sqrt(ay * ay + az * az))) - st.roll0;

	// same as for roll but for different axes
	pitch = dsp_updatecompl(cmpl + CMPL_PITCH, gx * dt,
		atan2f(ay, sqrt(ax * ax + az * az))) - st.pitch0;

	// update complimenraty filter for yaw axis and get next yaw
	// value. First signal is the speed of the rotation around Z
	// axis. Second signal is the heading value that is
	// calculated from magnetometer readings.
	
	yaw = circf(dsp_updatecirccompl(cmpl + CMPL_YAW, -gz * dt,
		qmc_heading(roll, -pitch,
			qmcdata.fx, qmcdata.fy, qmcdata.fz)) - st.yaw0);

	// calculate gravity direction vector in IMU coordination system
	// using pitch and roll values;
	vx = cos(-pitch) * sin(-roll);
	vy = -sin(-pitch);
	vz = cos(-pitch) * cos(-roll);

	// update vertical acceleration using acceleration
	// vector to gravity vector projection
	va = (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz);

	dsp_updatelpf(lpf + LPF_VAU, va);
	dsp_updatelpf(lpf + LPF_VAPT1, va);
	dsp_updatelpf(lpf + LPF_VAAVG, va);
	
	log_write(LOG_CUSTOM0, dsp_getlpf(lpf + LPF_VAU));

	vx = sin(-roll) * sin(-pitch);
	vy = cos(-pitch);
	vz = cos(-roll) * sin(-pitch);

	dsp_updatelpf(lpf + LPF_FA, (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz));

	ht = st.hoverthrottle / (cosf(-pitch) * cosf(-roll));

