PinkFluffyUnic0rn/stm32flight/main.c
	// if vertical acceleration is negative, most likely
	// quadcopter is upside down, perform emergency disarm
	if (dsp_getlpf(lpf + LPF_THR) < -0.5) {
		emergencydisarm = 1;
		setthrust(0.0, 0.0, 0.0, 0.0);
		en = 0.0;
	}

	// write roll, pitch and yaw values into log
	log_write(LOG_ROLL, roll);
	log_write(LOG_PITCH, pitch);
	log_write(LOG_YAW, yaw);

	if (speedpid) {
		// if in single PID loop mode for tilt
		// (called accro mode), use only rotation speed values
		// from the gyroscope. Update speed PID controllers for
		// roll and pitch and get next correction values.
		rollcor = dsp_pidbl(pid + PID_ROLLS, rolltarget, gy);
		pitchcor = dsp_pidbl(pid + PID_PITCHS, pitchtarget, gx);
	}
	else {
		// if in double loop mode for tilt (most commonly used
		// mode), first update roll and pitch POSITION PID
		// controllers using currect roll and values and targets
		// got from ERLS and get next correction values.
		rollcor = dsp_pidbl(pid + PID_ROLLP, rolltarget, roll);
		pitchcor = dsp_pidbl(pid + PID_PITCHP, pitchtarget, pitch);

		// then use this values to update roll and pitch speed
		// PID controllers and get next SPEED correction values.
		rollcor = dsp_pidbl(pid + PID_ROLLS, rollcor, gy);
		pitchcor = dsp_pidbl(pid + PID_PITCHS, pitchcor, gx);
	}

	if (yawspeedpid) {
		// if single PID loop mode for yaw is used just use
		// rotation speed values around axis Z to upadte yaw PID
		// controller and get next yaw correciton value
		yawcor = dsp_pidbl(pid + PID_YAWS, yawtarget, gz);
	}
	else {
		// if in double loop mode for yaw, first use yaw value
		// calcualted using magnetometer and yaw target got from
		// ELRS remote to update yaw POSITION PID controller and
		// get it's next correciton value.
		yawcor = dsp_circpid(&yawpv, yawtarget, yaw, dt);

		// then use this value to update yaw speed PID
		// controller and get next yaw SPEED correction value
		yawcor = dsp_pidbl(pid + PID_YAWS, yawcor, gz);
	}

	if (altmode == ALTMODE_POS) {
		// if altitude hold mode enabled, first use altitude
		// got from barometer readings and target altitude from
		// ELRS remote to update altitude PID controller and
		// get it's next correction value
		thrustcor = dsp_pidbl(pid + PID_ALT, thrust,
			dsp_getcompl(cmpl + CMPL_ALT) - alt0);

		// then use altitude correction value and climb rate
		// calculated by complimentary filter (barometer
		// differentiating and accelerometer Z-axis integration)
		// to update climb rate PID controller and get it's next
		// correction value
		thrustcor = dsp_pidbl(pid + PID_CLIMBRATE, thrustcor,
			dsp_getcompl(cmpl + CMPL_CLIMBRATE));
		
		// and next use climb rate correction value to update
		// vertial acceleration PID controller and get next
		// thrust correction value
		thrustcor = dsp_pidbl(pid + PID_VA, thrustcor + 1.0,
			dsp_getlpf(lpf + LPF_VAPT1)) + ht;	
	}
	else if (altmode == ALTMODE_SPEED) {
		// if consttant climb rate mode, first use climb rate
		// calculated by complimentary filter (barometer
		// differentiating and accelerometer Z-axis integration)
		// and target climb rate from ELRS remote to update
		// climb rate PID controller and get it's next
		// correction value
		thrustcor = dsp_pidbl(pid + PID_CLIMBRATE, thrust,
			dsp_getcompl(cmpl + CMPL_CLIMBRATE));	

		// and next use climb rate correction value to update
		// vertial acceleration PID controller and get next
		// thrust correction value
		thrustcor = dsp_pidbl(pid + PID_VA, thrustcor + 1.0,
			dsp_getlpf(lpf + LPF_VAPT1)) + ht;	
	}
	else {
		if (hovermode) {
			// if no altitude hold and hover throttle mode
			// is enabled, update vertical acceleration PID
			// controller using next low-pass filtered
			// value of vertical acceleration and target
			// got from ERLS remote
			thrustcor = dsp_pidbl(pid + PID_VA,
				thrust + 1.0,
				dsp_getlpf(lpf + LPF_VAPT1)) + ht;
		}
		else {
			// if no altitude hold and hover throttle mode
			// is disabled, update thrust PID controller
			// using next low-pass filtered value of thrust
			// and target got from ERLS remote
			thrustcor = dsp_pidbl(pid + PID_VA,
				thrust + 1.0,
				dsp_getlpf(lpf + LPF_THR));
		}
	}

	// reset bilinear PID-controllers when disarmed
	if (en < 0.5) {
		dsp_resetpidbl(pid + PID_PITCHP);
		dsp_resetpidbl(pid + PID_ROLLP);
		dsp_resetpidbl(pid + PID_PITCHS);
		dsp_resetpidbl(pid + PID_ROLLS);
		dsp_resetpids(&yawpv);
		dsp_resetpidbl(pid + PID_YAWS);
		dsp_resetpidbl(pid + PID_VA);
		dsp_resetpidbl(pid + PID_CLIMBRATE);
		dsp_resetpidbl(pid + PID_ALT);
	}

	// disable I-term for all
	// PID-controller, if no throttle
	if ((altmode == ALTMODE_ACCEL && thrust < 0
			&& !hovermode)
		|| (altmode == ALTMODE_SPEED
			&& thrust < -0.95 * st.climbratemax)
		|| (altmode == ALTMODE_POS && thrust < 0.01)) {
		dsp_resetpidbls(pid + PID_PITCHP);
		dsp_resetpidbls(pid + PID_ROLLP);
		dsp_resetpidbls(pid + PID_PITCHS);
		dsp_resetpidbls(pid + PID_ROLLS);
		dsp_resetpids(&yawpv);
		dsp_resetpidbls(pid + PID_YAWS);
		dsp_resetpidbls(pid + PID_VA);
		dsp_resetpidbls(pid + PID_CLIMBRATE);
		dsp_resetpidbls(pid + PID_ALT);
	}

	// calculate weights for motors
	// thrust calibration values
	ltm = (1.0 + st.rsc / 2) * (1.0 + st.psc / 2);
	rtm = (1.0 - st.rsc / 2) * (1.0 + st.psc / 2);
	lbm = (1.0 + st.rsc / 2) * (1.0 - st.psc / 2);
	rbm = (1.0 - st.rsc / 2) * (1.0 - st.psc / 2);

	// if final thrust is greater than
	// limit set it to the limit
	thrustcor = thrustcor > st.thrustmax ? st.thrustmax : thrustcor;

	// update motors thrust based on calculated values. For
	// quadcopter it's enought to split correction in half for
	// 3 pairs of motors: left and right for roll, top and bottom
	// for pitch and two diagonals (spinning in oposite directions)
	// for yaw.
	setthrust(en * ltm * (thrustcor + 0.5 * rollcor
			+ 0.5 * pitchcor - 0.5 * yawcor),
		en * rtm * (thrustcor - 0.5 * rollcor
			+ 0.5 * pitchcor + 0.5 * yawcor),	
		en * lbm * (thrustcor + 0.5 * rollcor
			- 0.5 * pitchcor + 0.5 * yawcor),
		en * rbm * (thrustcor - 0.5 * rollcor
			- 0.5 * pitchcor - 0.5 * yawcor));

	// update loops counter
	++loops;

