PinkFluffyUnic0rn/stm32flight/main.c
	// wait a little to let stm32 periphery and
	// board's devices power on
	HAL_Delay(1000);

	// init stm32 periphery
	periph_init();

	// reading settings from memory current
	// memory slot, which is 0 at start
	readsettings(curslot);

	// init board's devices
	esc_init();
	icm_init();
	qmc_init();
	espdev_init();
	crsfdev_init();
	w25dev_init();
	m10dev_init();
	uartdev_init();
	dps_init();
	irc_init();

	// initilize stabilization routine
	setstabilize(0);

	// set device that is used to logging
	log_setdev(&flashdev);

	initautopilot();

	// initilize periodic events
	inittimev(evs + TEV_PID, 0, PID_FREQ, stabilize);
	inittimev(evs + TEV_CHECK, 0, CHECK_FREQ, checkconnection);
	inittimev(evs + TEV_DPS, 1 * DPS_FREQ / 5, DPS_FREQ, dpsupdate);
	inittimev(evs + TEV_QMC, 2 * QMC_FREQ / 5, QMC_FREQ, qmcupdate);
	inittimev(evs + TEV_LOG, 0, st.logfreq, logupdate);
	inittimev(evs + TEV_TELE, 3 * TELE_FREQ / 5, 
		TELE_FREQ, telesend);
	inittimev(evs + TEV_POWER, 4 * POWER_FREQ / 5,
		POWER_FREQ, powercheck);
	inittimev(evs + TEV_AUTOPILOT, 0, AUTOPILOT_FREQ,
		autopilotupdate);

	// initilize debug commands
	addcommand("r", rcmd);
	addcommand("c", ccmd);
	addcommand("info", infocmd);
	addcommand("pid", pidcmd);
	addcommand("flash", flashcmd);
	addcommand("compl", complcmd);
	addcommand("lpf", lpfcmd);
	addcommand("adj", adjcmd);
	addcommand("log", logcmd);
	addcommand("ctrl", ctrlcmd);
	addcommand("autopilot", autopilotcmd);
	addcommand("system", systemcmd);
	addcommand("irc", irccmd);
	addcommand("motor", motorcmd);
	addcommand("get", getcmd);

	// initilize ERLS timer. For now ERLS polling is not a periodic
	// event and called as frequently as possible, so it needs this
	// separate timer.
	elrsus = 0;

	// main control loop
	while (1) {
		char cmd[CMDSIZE];
		struct crsf_data cd;
		struct m10_data nd;
		int c, i;

		// reset iteration time counter
		__HAL_TIM_SET_COUNTER(&htim8, 0);

		// poll for configuration and telemetry commands
		// from debug wifi connection
		if (dev[DEV_ESP].read(dev[DEV_ESP].priv, &cmd,
			CMDSIZE) >= 0) {
			runcommand(dev + DEV_ESP, cmd);
		}

		// poll for configuration and telemtry commands
		// from debug uart connection
		if (dev[DEV_UART].read(dev[DEV_UART].priv, &cmd,
			UART_CMDSIZE) >= 0) {
			runcommand(dev + DEV_UART, cmd);
		}

		// read the ELRS remote's packet
		if (dev[DEV_CRSF].read(dev[DEV_CRSF].priv, &cd,
			sizeof(struct crsf_data)) >= 0) {
			crsfcmd(&cd, elrsus);
			elrsus = 0;
		}

		// check the M10 messages
		if (dev[DEV_M10].read(dev[DEV_M10].priv, &nd,
			sizeof(struct m10_data)) >= 0) {
			m10msg(&nd);
		}

		// check all periodic events context's and run callbacks
		// if enough time passed. Reset their timers after.
		for (i = 0; i < TEV_COUNT; ++i) {
			if (checktimev(evs + i)) {
				evs[i].cb(evs[i].ms);
				resettimev(evs + i);
			}
		}

		// get microseconds passed in this iteration
		// one iteration duration should take at least
		// some time, 100us was choosen
		while ((c = __HAL_TIM_GET_COUNTER(&htim8)) < 1);

		// update periodic events timers
		for (i = 0; i < TEV_COUNT; ++i)
			updatetimev(evs + i, c);

		// update ELRS timer
		elrsus += c;
	}

	return 0;
}
